
// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.


    let a = +prompt('Введите первое число');
    let b = +prompt('Введите второе число');

        if (a > b){
    console.log('a');
    }
        else if (b > a) {
    console.log('b');
        }

        else {
    console.log('числа равны')
}


//     - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

let home = +prompt('Введіть номер квартири з 1 по 90');

if (home <= 20) {
    console.log('Перший під\'їзд')
} else if (home <= 48) {

    console.log('Другий під\'їзд')
} else if (home <= 90) {

    console.log(' Третій  під\'їзд')
}

//
// - Ми маємо змінну number в яку користувач задає числове значення,
//     якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

let number=+prompt( 'Введіть число');

let asd=number===10?'Вірно':'Невірно';
console.log(asd);

// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 4.
// якщо в змінну записали щось інше, спрацьовує else


let x= prompt('Введіть значення');
let y= +prompt('Введіть число')

let x=(true);
    if ( typeof x === 'number'){
    document.write(1);
} else if ( typeof x === 'string'){
    document.write(2);
} else if ( typeof x === 'boolean' ){
    document.write(3);
} else if (typeof  x === 'objekt & array'){
    document.write(4);
} else{document.write('Введіть інше значення');
}

// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

let t=(4);
if (t>=10 && t<= 22) {
    document.write('Ми йдемо вчитися')
}
else {
    document.write('Сидімо вдома і вчимося онлайн')
}

//
// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз.
//     (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

let key = '9';
switch (key) {
    case '1':
        console.log('Ви виграли авто');
        break;

    case'2':
        console.log('Ви виграли телефон');
        break;

    case'3':
        console.log('Ви виграли мотоцикл');
        break;

    case'4':
        console.log('Ви виграли відпочинок у Карпатах');
        break;

    case'5':
        console.log('Ви виграли Sony PlaiStation');
        break;
    default:
        console.log('Число не вірне!')
}



